# คำสั่งแสดงผลข้อมูลใด หลายประเภทใน  prnit() เดียว เขียนได้ 4 วิธี
#วิธีที่1 ใช้ , (ตรงที่ , เวลาแสดงผลจะเว้น 1 ช่อง/space)
print('aaa',1258,"bangna",10+10,True,125.2225,False,)

#วิธีที่ 2 ใช้ + (ฃข้อมูลไหนที่ไม่ใช่ string ต้องทำให้เป็น string ก่อนด้วนฟังก์ชั่น str())
print('aaa' + str(1258) + "bangna" + str(10+10) + str(True) + str(125.2225))
print('dti' + str(999) + str(1258) + str(10+10) + 'hi')

#วิธีที่ 3 ใช้ format() ข้อมูลที่จะแสดงต้องเป็น string
#(ข้อมูลไหนที่ไม่ใช่ string ให้เขียน {} ณ ตำแหน่งที่แสดงนั้นได้เลย)
print('dti {} Bangn {} {} hi {} '.format(999,1258,10+10,'hi'))
# Index number        1    2    3    4
print('{1} {3}'.format('aa','bb','cc','dd'))

#วิธีที่  4 ใช้ f-string ข้อมูลจะต้องเป็น string โดยจะต้องมีแอปนำหน้า
#(ข้อมูลที่ไม่ใช่ string ให้เขียน {} ณ ตำแหน่งที่แสดงนั้นได้เลย)
print(f'dti {999} Bangna {10+20} {True} Hi {158.45}')

