# สร้างโปรแกรมคำนวณค่า BMI โดยรับ ชื่อ ค่าส่วนสูง(เซ็นติเมตร) และนำหนัก (กิโลกรัม) ทางแป้นพิมพ์ แล้วแสดงผลค่า BMI ที่คำนวณได้ทางหน้าจอ โดย
# BMI =  น้ำหนัก หารด้วย ส่วนสูงยกกำลัง2
 
# --------------------------------
#    โปรแกรม BMI CALCULATOR
# --------------------------------
# ป้อนชื่อ: <input>
# ป้อนน้ำหนัก: <input>
# ป้อนส่วนสูง: <input>
# --------------------------------
# คุณ <output> หนัก <output> kg. สูง <output> m.
# มีค่า BMI เป็น <output>
# --------------------------------

print('-----------------------------')
print(' โปรแกรม BMI CALCULATOR')
print('-----------------------------')
emp_name = float (input('ป้อนชื่อ : '))
emp_weight = int( input('ป้อนน้ำหนัก (Kg) :  '))
emp_height = int( input('ป้อนส่วนสูง (cm) :  '))
print('-----------------------------')

