# สร้างโปรแกรม Money Share V. 1.0 เพื่อคำนวณหาเงินที่ต้องหารกันว่าการกันคนละกี่บาท โดยป้อนจำนวนเงิน 
# และจำนวนคนทางแป้นพิมพ์แล้วแสดงผลเงินที่ต้องหารกันว่าต้องหารกันคนละกี่บาททางหน้าจอ
 
# ------------------------
#    โปรแกรม Money Share
# ------------------------
# ป้อนจำนวนเงิน: <input>
# ป้อนจำนวนคน: <input>
# ------------------------
# สรุปหารกันคนละ: <output> บาท
# ------------------------

print('-----------------------------')
print('โปรแกรม Money Share')
print('-----------------------------')
emp_amount = float (input('ป้อนจำนวณเงิน : บาท '))
emp_quantity = int( input('ป้อนจำนวณคน : บาท '))
print('-----------------------------')
average = (emp_amount  / emp_quantity)
print(f'สรุปหารกันคนละ {average :,.2f} บาท')