# โปรแกรมซึ่งรับชื่อ และปีเกิดของผู้ใช้โปรแกรมทางแป้นพิมพ์ โดยหากอายุมีค่าตั้งแต่ 35 ปีขึ้นไป ให้แสดงข้อความว่า 
#  "คุณแก่แล้ว..." หากไม่ถึงให้แสดงข้อความ "คุณยังไม่แก่..." ทางหน้าจอ

from datetime import datetime

print('+++++++++++++++++++++++++++++++')
print(' โปรแกรมตรวจวัยวุฒิ ')
print('+++++++++++++++++++++++++++++++')
your_name = input ('ป้อนชื่อ ==> ')
your_yearborn = int(input('ป้อนปีเกิด (พ.ศ.) ==> '))
print('+++++++++++++++++++++++++++++++')

your_age = (datetime.now().year+543) - your_yearborn
if your_age >= 55 :
    print('คุณ{} อายุ{} ปี แก่แล้วนะ'.format (your_name,your_age))
    print('เข้าใจนะ')
else :
    print('คุณ{} อายุ{} ปี ยังไม่แก่นะ'.format (your_name,your_age))
    print('ดีใจด้วย')

print('+++++++++++++++++++++++++++++++')

