# โปรแกรมคำนวณราคาสินค้าที่รับส่วนลดแล้ว 
# โดยป้อนรหัสสินค้า ชื่อสินค้า ประเภทสินค้า ซึ่งมี 4 ประเภท คือ food(F/f), woman(W/w), man(M/m), kitchen(K/k) โดยป้อนเป็นตัวย่อ
#   และราคาสินค้าทางแป้นพิมพ์ แล้วคำนวณราคาสินค้าที่รับส่วนลดแล้วทางหน้าจอ
#  โดยสินค้าประเภท food ลด 2% ของราคาสินค้า, woman ลด 4% ของราคาสินค้า, man ลด 6% ของราคาสินค้า, kitchen ลด 10% ของราคาสินค้า 
# หากป้อนประเภทสินค้าผิดจากที่กำหนดให้แสดงข้อความ "คุณป้อนประเภทผิด ไม่สามารถคำนวณได้!!!"


print('=====================================')
print(' โปรแกรมคำนวณราคาสินค้าที่รับส่วนลดแล้ว ')
print('=====================================')

รหัส = input('ป้อนรหัสสินค้า : ')
ชื่อ = input('ป้อนชื่อสินค้า : ')
ประเภท = input('ป้อนประเภทสินค้า (F/f, W/w, M/m, K/k) : ')
ราคา = float(input('ป้อนราคาสินค้า : '))
print('=====================================')

if ประเภท =='F' or ประเภท == 'f' :
    ราคาส่วนลด = ราคา - (ราคา * 2 / 100)
    print(f'ราคาขายสินค้า {ชื่อ} คือ {ราคาส่วนลด:,.2f} บาท')
elif ประเภท =='W' or ประเภท == 'w' :
    ราคาส่วนลด = ราคา - (ราคา * 4 / 100)
    print(f'ราคาขายสินค้า {ชื่อ} คือ {ราคาส่วนลด:,.2f} บาท')
elif ประเภท =='M' or ประเภท == 'm' :
    ราคาส่วนลด = ราคา - (ราคา * 6 / 100)
    print(f'ราคาขายสินค้า {ชื่อ} คือ {ราคาส่วนลด:,.2f} บาท')
elif ประเภท =='K' or ประเภท == 'k' :
    ราคาส่วนลด = ราคา - (ราคา * 10 / 100)
    print(f'ราคาขายสินค้า {ชื่อ} คือ {ราคาส่วนลด:,.2f} บาท')
else :
    print(' คุณป้อนประเภทผิด ไม่สามารถคำนวณ เข้าใจตรงกันนะไอเอ๋อ!!! ')
print('=====================================')
